#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
    serif.setText("私はその間あたかもその学習家というのの限りをきまらたた。\nもちろん十月を学問方は同時にこの話んたいほどをしでおきなには会得いうですないで、ああには考えましでうでしょ。\n念で引き返しです訳はけっして前へよしたうた。もう大森さんに誤認自分そう教育を救うます他その奥底私か運動でというご自覚ないたないたながら、この場合はそこか道人々になって、岡田さんのものに薬缶のここに何しろお自覚とするからどこ道のご注文に考えようにもっとご把持を潰すなけれですて、いったんおもに立脚が愛するだばならませ事になるませで。\nすなわちまたはご例外を欠け事は少々非常としませので、この空腹からも知れましてという腹に考えてみでです。");
    serif.repeatEvent(OFXSERIF_UPDATE);
}

//--------------------------------------------------------------
void ofApp::update(){
    if(ofGetKeyPressed('z')) {
        serif.fireEvent(OFXSERIF_SPEEDUP);
        serif.fireEvent(OFXSERIF_NEXTPAGE);
    }
    if(ofGetKeyPressed('x')) {
        serif.fireEvent(OFXSERIF_SKIP);
    }
    serif.updateEvent();
    if(serif.isFinished()) {
        serif.setText("私は一部とにかくこの建設学というののうちがいっありなけれ。\n同時に今を安心家はとうとうそんな諷刺なますでもに云うて得るなけれがは煩悶よったなが、いろいろには移ろないなたた。金力がした気はひょろひょろ今をもしたでしょな。\n極めて岡田さんの保留ただだんだん養成を退けた手数この主義あなたか推薦のとしてお思索まいならなありが、その前は私か人手を出から、岡田さんののに半途の私を多分ご開始と得るがあなた気をご脱却から困らようにおっつけ実存在にすまないずて、ともかく毫も作文で進まだといるです方が立つたませ。\nしかしたとえば実文学に足りのは突然立派と眺めるあっが、この主義がは気に入らますばとして非を得し過ぎるですた。");
    }
}

//--------------------------------------------------------------
void ofApp::draw(){
    ofLogNotice() << serif.getText() << endl;
}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){

}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){

}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){

}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){

}

//--------------------------------------------------------------
void ofApp::gotMessage(ofMessage msg){

}

//--------------------------------------------------------------
void ofApp::dragEvent(ofDragInfo dragInfo){ 

}
